MikroElektronika/core_packages/PIC/XC8/def/PIC16F1783/mcu.h
// Register: PSMC1PHH
#define PSMC1PHH PSMC1PHH
extern volatile unsigned char           PSMC1PHH            __at(0x822);
#ifndef _LIB_BUILD
asm("PSMC1PHH equ 0822h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC1PH8               :1;
        unsigned PSMC1PH9               :1;
        unsigned PSMC1PH10              :1;
        unsigned PSMC1PH11              :1;
        unsigned PSMC1PH12              :1;
        unsigned PSMC1PH13              :1;
        unsigned PSMC1PH14              :1;
        unsigned PSMC1PH15              :1;
    };
} PSMC1PHHbits_t;
extern volatile PSMC1PHHbits_t PSMC1PHHbits __at(0x822);
// bitfield macros
#define _PSMC1PHH_PSMC1PH8_POSN                             0x0
#define _PSMC1PHH_PSMC1PH8_POSITION                         0x0
#define _PSMC1PHH_PSMC1PH8_SIZE                             0x1
#define _PSMC1PHH_PSMC1PH8_LENGTH                           0x1
#define _PSMC1PHH_PSMC1PH8_MASK                             0x1
#define _PSMC1PHH_PSMC1PH9_POSN                             0x1
#define _PSMC1PHH_PSMC1PH9_POSITION                         0x1
#define _PSMC1PHH_PSMC1PH9_SIZE                             0x1
#define _PSMC1PHH_PSMC1PH9_LENGTH                           0x1
#define _PSMC1PHH_PSMC1PH9_MASK                             0x2
#define _PSMC1PHH_PSMC1PH10_POSN                            0x2
#define _PSMC1PHH_PSMC1PH10_POSITION                        0x2
#define _PSMC1PHH_PSMC1PH10_SIZE                            0x1
#define _PSMC1PHH_PSMC1PH10_LENGTH                          0x1
#define _PSMC1PHH_PSMC1PH10_MASK                            0x4
#define _PSMC1PHH_PSMC1PH11_POSN                            0x3
#define _PSMC1PHH_PSMC1PH11_POSITION                        0x3
#define _PSMC1PHH_PSMC1PH11_SIZE                            0x1
#define _PSMC1PHH_PSMC1PH11_LENGTH                          0x1
#define _PSMC1PHH_PSMC1PH11_MASK                            0x8
#define _PSMC1PHH_PSMC1PH12_POSN                            0x4
#define _PSMC1PHH_PSMC1PH12_POSITION                        0x4
#define _PSMC1PHH_PSMC1PH12_SIZE                            0x1
#define _PSMC1PHH_PSMC1PH12_LENGTH                          0x1
#define _PSMC1PHH_PSMC1PH12_MASK                            0x10
#define _PSMC1PHH_PSMC1PH13_POSN                            0x5
#define _PSMC1PHH_PSMC1PH13_POSITION                        0x5
#define _PSMC1PHH_PSMC1PH13_SIZE                            0x1
#define _PSMC1PHH_PSMC1PH13_LENGTH                          0x1
#define _PSMC1PHH_PSMC1PH13_MASK                            0x20
#define _PSMC1PHH_PSMC1PH14_POSN                            0x6
#define _PSMC1PHH_PSMC1PH14_POSITION                        0x6
#define _PSMC1PHH_PSMC1PH14_SIZE                            0x1
#define _PSMC1PHH_PSMC1PH14_LENGTH                          0x1
#define _PSMC1PHH_PSMC1PH14_MASK                            0x40
#define _PSMC1PHH_PSMC1PH15_POSN                            0x7
#define _PSMC1PHH_PSMC1PH15_POSITION                        0x7
#define _PSMC1PHH_PSMC1PH15_SIZE                            0x1
#define _PSMC1PHH_PSMC1PH15_LENGTH                          0x1
#define _PSMC1PHH_PSMC1PH15_MASK                            0x80

// Register: PSMC1DC
#define PSMC1DC PSMC1DC
extern volatile unsigned short          PSMC1DC             __at(0x823);
#ifndef _LIB_BUILD
asm("PSMC1DC equ 0823h");
#endif

// Register: PSMC1DCL
#define PSMC1DCL PSMC1DCL
extern volatile unsigned char           PSMC1DCL            __at(0x823);
#ifndef _LIB_BUILD
asm("PSMC1DCL equ 0823h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC1DC0               :1;
        unsigned PSMC1DC1               :1;
        unsigned PSMC1DC2               :1;
        unsigned PSMC1DC3               :1;
        unsigned PSMC1DC4               :1;
        unsigned PSMC1DC5               :1;
        unsigned PSMC1DC6               :1;
        unsigned PSMC1DC7               :1;
    };
} PSMC1DCLbits_t;
extern volatile PSMC1DCLbits_t PSMC1DCLbits __at(0x823);
// bitfield macros
#define _PSMC1DCL_PSMC1DC0_POSN                             0x0
#define _PSMC1DCL_PSMC1DC0_POSITION                         0x0
#define _PSMC1DCL_PSMC1DC0_SIZE                             0x1
#define _PSMC1DCL_PSMC1DC0_LENGTH                           0x1
#define _PSMC1DCL_PSMC1DC0_MASK                             0x1
#define _PSMC1DCL_PSMC1DC1_POSN                             0x1
#define _PSMC1DCL_PSMC1DC1_POSITION                         0x1
#define _PSMC1DCL_PSMC1DC1_SIZE                             0x1
#define _PSMC1DCL_PSMC1DC1_LENGTH                           0x1
#define _PSMC1DCL_PSMC1DC1_MASK                             0x2
#define _PSMC1DCL_PSMC1DC2_POSN                             0x2
#define _PSMC1DCL_PSMC1DC2_POSITION                         0x2
#define _PSMC1DCL_PSMC1DC2_SIZE                             0x1
#define _PSMC1DCL_PSMC1DC2_LENGTH                           0x1
#define _PSMC1DCL_PSMC1DC2_MASK                             0x4
#define _PSMC1DCL_PSMC1DC3_POSN                             0x3
#define _PSMC1DCL_PSMC1DC3_POSITION                         0x3
#define _PSMC1DCL_PSMC1DC3_SIZE                             0x1
#define _PSMC1DCL_PSMC1DC3_LENGTH                           0x1
#define _PSMC1DCL_PSMC1DC3_MASK                             0x8
#define _PSMC1DCL_PSMC1DC4_POSN                             0x4
#define _PSMC1DCL_PSMC1DC4_POSITION                         0x4
#define _PSMC1DCL_PSMC1DC4_SIZE                             0x1
#define _PSMC1DCL_PSMC1DC4_LENGTH                           0x1
#define _PSMC1DCL_PSMC1DC4_MASK                             0x10
#define _PSMC1DCL_PSMC1DC5_POSN                             0x5
#define _PSMC1DCL_PSMC1DC5_POSITION                         0x5
#define _PSMC1DCL_PSMC1DC5_SIZE                             0x1
#define _PSMC1DCL_PSMC1DC5_LENGTH                           0x1
#define _PSMC1DCL_PSMC1DC5_MASK                             0x20
#define _PSMC1DCL_PSMC1DC6_POSN                             0x6
#define _PSMC1DCL_PSMC1DC6_POSITION                         0x6
#define _PSMC1DCL_PSMC1DC6_SIZE                             0x1
#define _PSMC1DCL_PSMC1DC6_LENGTH                           0x1
#define _PSMC1DCL_PSMC1DC6_MASK                             0x40
#define _PSMC1DCL_PSMC1DC7_POSN                             0x7
#define _PSMC1DCL_PSMC1DC7_POSITION                         0x7
#define _PSMC1DCL_PSMC1DC7_SIZE                             0x1
#define _PSMC1DCL_PSMC1DC7_LENGTH                           0x1
#define _PSMC1DCL_PSMC1DC7_MASK                             0x80

// Register: PSMC1DCH
#define PSMC1DCH PSMC1DCH
extern volatile unsigned char           PSMC1DCH            __at(0x824);
#ifndef _LIB_BUILD
asm("PSMC1DCH equ 0824h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC1DC8               :1;
        unsigned PSMC1DC9               :1;
        unsigned PSMC1DC10              :1;
        unsigned PSMC1DC11              :1;
        unsigned PSMC1DC12              :1;
        unsigned PSMC1DC13              :1;
        unsigned PSMC1DC14              :1;
        unsigned PSMC1DC15              :1;
    };
} PSMC1DCHbits_t;
extern volatile PSMC1DCHbits_t PSMC1DCHbits __at(0x824);
// bitfield macros
#define _PSMC1DCH_PSMC1DC8_POSN                             0x0
#define _PSMC1DCH_PSMC1DC8_POSITION                         0x0
#define _PSMC1DCH_PSMC1DC8_SIZE                             0x1
#define _PSMC1DCH_PSMC1DC8_LENGTH                           0x1
#define _PSMC1DCH_PSMC1DC8_MASK                             0x1
#define _PSMC1DCH_PSMC1DC9_POSN                             0x1
#define _PSMC1DCH_PSMC1DC9_POSITION                         0x1
#define _PSMC1DCH_PSMC1DC9_SIZE                             0x1
#define _PSMC1DCH_PSMC1DC9_LENGTH                           0x1
#define _PSMC1DCH_PSMC1DC9_MASK                             0x2
#define _PSMC1DCH_PSMC1DC10_POSN                            0x2
#define _PSMC1DCH_PSMC1DC10_POSITION                        0x2
#define _PSMC1DCH_PSMC1DC10_SIZE                            0x1
#define _PSMC1DCH_PSMC1DC10_LENGTH                          0x1
#define _PSMC1DCH_PSMC1DC10_MASK                            0x4
#define _PSMC1DCH_PSMC1DC11_POSN                            0x3
#define _PSMC1DCH_PSMC1DC11_POSITION                        0x3
#define _PSMC1DCH_PSMC1DC11_SIZE                            0x1
#define _PSMC1DCH_PSMC1DC11_LENGTH                          0x1
#define _PSMC1DCH_PSMC1DC11_MASK                            0x8
#define _PSMC1DCH_PSMC1DC12_POSN                            0x4
#define _PSMC1DCH_PSMC1DC12_POSITION                        0x4
#define _PSMC1DCH_PSMC1DC12_SIZE                            0x1
#define _PSMC1DCH_PSMC1DC12_LENGTH                          0x1
#define _PSMC1DCH_PSMC1DC12_MASK                            0x10
#define _PSMC1DCH_PSMC1DC13_POSN                            0x5
#define _PSMC1DCH_PSMC1DC13_POSITION                        0x5
#define _PSMC1DCH_PSMC1DC13_SIZE                            0x1
#define _PSMC1DCH_PSMC1DC13_LENGTH                          0x1
#define _PSMC1DCH_PSMC1DC13_MASK                            0x20
#define _PSMC1DCH_PSMC1DC14_POSN                            0x6
#define _PSMC1DCH_PSMC1DC14_POSITION                        0x6
#define _PSMC1DCH_PSMC1DC14_SIZE                            0x1
#define _PSMC1DCH_PSMC1DC14_LENGTH                          0x1
#define _PSMC1DCH_PSMC1DC14_MASK                            0x40
#define _PSMC1DCH_PSMC1DC15_POSN                            0x7
#define _PSMC1DCH_PSMC1DC15_POSITION                        0x7
#define _PSMC1DCH_PSMC1DC15_SIZE                            0x1
#define _PSMC1DCH_PSMC1DC15_LENGTH                          0x1
#define _PSMC1DCH_PSMC1DC15_MASK                            0x80

