MikroElektronika/core_packages/PIC/XC8/def/PIC16F1783/mcu.h
extern volatile __bit                   P2MSRC3             __at(0x4193);	// @ (0x832 * 8 + 3)
#define                                 P2MSRC3_bit         _BIT_ACCESS(PSMC2MDL,3)
// PSMC2OEN<P2OEA>
extern volatile __bit                   P2OEA               __at(0x41A8);	// @ (0x835 * 8 + 0)
#define                                 P2OEA_bit           _BIT_ACCESS(PSMC2OEN,0)
// PSMC2OEN<P2OEB>
extern volatile __bit                   P2OEB               __at(0x41A9);	// @ (0x835 * 8 + 1)
#define                                 P2OEB_bit           _BIT_ACCESS(PSMC2OEN,1)
// PSMC2PHS<P2PHSC1>
extern volatile __bit                   P2PHSC1             __at(0x41D1);	// @ (0x83A * 8 + 1)
#define                                 P2PHSC1_bit         _BIT_ACCESS(PSMC2PHS,1)
// PSMC2PHS<P2PHSC2>
extern volatile __bit                   P2PHSC2             __at(0x41D2);	// @ (0x83A * 8 + 2)
#define                                 P2PHSC2_bit         _BIT_ACCESS(PSMC2PHS,2)
// PSMC2PHS<P2PHSC3>
extern volatile __bit                   P2PHSC3             __at(0x41D3);	// @ (0x83A * 8 + 3)
#define                                 P2PHSC3_bit         _BIT_ACCESS(PSMC2PHS,3)
// PSMC2PHS<P2PHSIN>
extern volatile __bit                   P2PHSIN             __at(0x41D7);	// @ (0x83A * 8 + 7)
#define                                 P2PHSIN_bit         _BIT_ACCESS(PSMC2PHS,7)
// PSMC2PHS<P2PHST>
extern volatile __bit                   P2PHST              __at(0x41D0);	// @ (0x83A * 8 + 0)
#define                                 P2PHST_bit          _BIT_ACCESS(PSMC2PHS,0)
// PSMC2POL<P2POLA>
extern volatile __bit                   P2POLA              __at(0x41B0);	// @ (0x836 * 8 + 0)
#define                                 P2POLA_bit          _BIT_ACCESS(PSMC2POL,0)
// PSMC2POL<P2POLB>
extern volatile __bit                   P2POLB              __at(0x41B1);	// @ (0x836 * 8 + 1)
#define                                 P2POLB_bit          _BIT_ACCESS(PSMC2POL,1)
// PSMC2PRS<P2PRSC1>
extern volatile __bit                   P2PRSC1             __at(0x41E1);	// @ (0x83C * 8 + 1)
#define                                 P2PRSC1_bit         _BIT_ACCESS(PSMC2PRS,1)
// PSMC2PRS<P2PRSC2>
extern volatile __bit                   P2PRSC2             __at(0x41E2);	// @ (0x83C * 8 + 2)
#define                                 P2PRSC2_bit         _BIT_ACCESS(PSMC2PRS,2)
// PSMC2PRS<P2PRSC3>
extern volatile __bit                   P2PRSC3             __at(0x41E3);	// @ (0x83C * 8 + 3)
#define                                 P2PRSC3_bit         _BIT_ACCESS(PSMC2PRS,3)
// PSMC2PRS<P2PRSIN>
extern volatile __bit                   P2PRSIN             __at(0x41E7);	// @ (0x83C * 8 + 7)
#define                                 P2PRSIN_bit         _BIT_ACCESS(PSMC2PRS,7)
// PSMC2PRS<P2PRST>
extern volatile __bit                   P2PRST              __at(0x41E0);	// @ (0x83C * 8 + 0)
#define                                 P2PRST_bit          _BIT_ACCESS(PSMC2PRS,0)
// PSMC2BLNK<P2REBM0>
extern volatile __bit                   P2REBM0             __at(0x41B8);	// @ (0x837 * 8 + 0)
#define                                 P2REBM0_bit         _BIT_ACCESS(PSMC2BLNK,0)
// PSMC2BLNK<P2REBM1>
extern volatile __bit                   P2REBM1             __at(0x41B9);	// @ (0x837 * 8 + 1)
#define                                 P2REBM1_bit         _BIT_ACCESS(PSMC2BLNK,1)
// PSMC2REBS<P2REBSC1>
extern volatile __bit                   P2REBSC1            __at(0x41C1);	// @ (0x838 * 8 + 1)
#define                                 P2REBSC1_bit        _BIT_ACCESS(PSMC2REBS,1)
// PSMC2REBS<P2REBSC2>
extern volatile __bit                   P2REBSC2            __at(0x41C2);	// @ (0x838 * 8 + 2)
#define                                 P2REBSC2_bit        _BIT_ACCESS(PSMC2REBS,2)
// PSMC2REBS<P2REBSC3>
extern volatile __bit                   P2REBSC3            __at(0x41C3);	// @ (0x838 * 8 + 3)
#define                                 P2REBSC3_bit        _BIT_ACCESS(PSMC2REBS,3)
// PSMC2REBS<P2REBSIN>
extern volatile __bit                   P2REBSIN            __at(0x41C7);	// @ (0x838 * 8 + 7)
#define                                 P2REBSIN_bit        _BIT_ACCESS(PSMC2REBS,7)
// PSMC2STR1<P2SSYNC>
extern volatile __bit                   P2SSYNC             __at(0x427F);	// @ (0x84F * 8 + 7)
#define                                 P2SSYNC_bit         _BIT_ACCESS(PSMC2STR1,7)
// PSMC2STR0<P2STRA>
extern volatile __bit                   P2STRA              __at(0x4270);	// @ (0x84E * 8 + 0)
#define                                 P2STRA_bit          _BIT_ACCESS(PSMC2STR0,0)
// PSMC2STR0<P2STRB>
extern volatile __bit                   P2STRB              __at(0x4271);	// @ (0x84E * 8 + 1)
#define                                 P2STRB_bit          _BIT_ACCESS(PSMC2STR0,1)
// PSMC2SYNC<P2SYNC0>
extern volatile __bit                   P2SYNC0             __at(0x4198);	// @ (0x833 * 8 + 0)
#define                                 P2SYNC0_bit         _BIT_ACCESS(PSMC2SYNC,0)
// PSMC2SYNC<P2SYNC1>
extern volatile __bit                   P2SYNC1             __at(0x4199);	// @ (0x833 * 8 + 1)
#define                                 P2SYNC1_bit         _BIT_ACCESS(PSMC2SYNC,1)
// PSMC2INT<P2TDCIE>
extern volatile __bit                   P2TDCIE             __at(0x4205);	// @ (0x840 * 8 + 5)
#define                                 P2TDCIE_bit         _BIT_ACCESS(PSMC2INT,5)
// PSMC2INT<P2TDCIF>
extern volatile __bit                   P2TDCIF             __at(0x4201);	// @ (0x840 * 8 + 1)
#define                                 P2TDCIF_bit         _BIT_ACCESS(PSMC2INT,1)
// PSMC2INT<P2TOVIE>
extern volatile __bit                   P2TOVIE             __at(0x4207);	// @ (0x840 * 8 + 7)
#define                                 P2TOVIE_bit         _BIT_ACCESS(PSMC2INT,7)
// PSMC2INT<P2TOVIF>
extern volatile __bit                   P2TOVIF             __at(0x4203);	// @ (0x840 * 8 + 3)
#define                                 P2TOVIF_bit         _BIT_ACCESS(PSMC2INT,3)
// PSMC2INT<P2TPHIE>
extern volatile __bit                   P2TPHIE             __at(0x4206);	// @ (0x840 * 8 + 6)
#define                                 P2TPHIE_bit         _BIT_ACCESS(PSMC2INT,6)
// PSMC2INT<P2TPHIF>
extern volatile __bit                   P2TPHIF             __at(0x4202);	// @ (0x840 * 8 + 2)
#define                                 P2TPHIF_bit         _BIT_ACCESS(PSMC2INT,2)
// PSMC2INT<P2TPRIE>
extern volatile __bit                   P2TPRIE             __at(0x4204);	// @ (0x840 * 8 + 4)
#define                                 P2TPRIE_bit         _BIT_ACCESS(PSMC2INT,4)
// PSMC2INT<P2TPRIF>
extern volatile __bit                   P2TPRIF             __at(0x4200);	// @ (0x840 * 8 + 0)
#define                                 P2TPRIF_bit         _BIT_ACCESS(PSMC2INT,0)
// SSPCON3<PCIE>
extern volatile __bit                   PCIE                __at(0x10BE);	// @ (0x217 * 8 + 6)
#define                                 PCIE_bit            _BIT_ACCESS(SSPCON3,6)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// SSPCON2<PEN>
extern volatile __bit                   PEN                 __at(0x10B2);	// @ (0x216 * 8 + 2)
#define                                 PEN_bit             _BIT_ACCESS(SSPCON2,2)
// OSCSTAT<PLLR>
extern volatile __bit                   PLLR                __at(0x4D6);	// @ (0x9A * 8 + 6)
#define                                 PLLR_bit            _BIT_ACCESS(OSCSTAT,6)
// OPTION_REG<PS0>
extern volatile __bit                   _PS0                 __at(0x4A8);	// @ (0x95 * 8 + 0)  // Note: Changed by MikroE
#define                                 PS0_bit             _BIT_ACCESS(OPTION_REG,0)
// OPTION_REG<PS1>
extern volatile __bit                   _PS1                 __at(0x4A9);	// @ (0x95 * 8 + 1)  // Note: Changed by MikroE
#define                                 PS1_bit             _BIT_ACCESS(OPTION_REG,1)
// OPTION_REG<PS2>
extern volatile __bit                   _PS2                 __at(0x4AA);	// @ (0x95 * 8 + 2)  // Note: Changed by MikroE
#define                                 PS2_bit             _BIT_ACCESS(OPTION_REG,2)
// OPTION_REG<PSA>
extern volatile __bit                   PSA                 __at(0x4AB);	// @ (0x95 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(OPTION_REG,3)
// PSMC1BLKF<PSMC1BLKF0>
extern volatile __bit                   PSMC1BLKF0          __at(0x4160);	// @ (0x82C * 8 + 0)
#define                                 PSMC1BLKF0_bit      _BIT_ACCESS(PSMC1BLKF,0)
// PSMC1BLKF<PSMC1BLKF1>
extern volatile __bit                   PSMC1BLKF1          __at(0x4161);	// @ (0x82C * 8 + 1)
#define                                 PSMC1BLKF1_bit      _BIT_ACCESS(PSMC1BLKF,1)
// PSMC1BLKF<PSMC1BLKF2>
extern volatile __bit                   PSMC1BLKF2          __at(0x4162);	// @ (0x82C * 8 + 2)
#define                                 PSMC1BLKF2_bit      _BIT_ACCESS(PSMC1BLKF,2)
// PSMC1BLKF<PSMC1BLKF3>
extern volatile __bit                   PSMC1BLKF3          __at(0x4163);	// @ (0x82C * 8 + 3)
#define                                 PSMC1BLKF3_bit      _BIT_ACCESS(PSMC1BLKF,3)
// PSMC1BLKF<PSMC1BLKF4>
extern volatile __bit                   PSMC1BLKF4          __at(0x4164);	// @ (0x82C * 8 + 4)
#define                                 PSMC1BLKF4_bit      _BIT_ACCESS(PSMC1BLKF,4)
// PSMC1BLKF<PSMC1BLKF5>
extern volatile __bit                   PSMC1BLKF5          __at(0x4165);	// @ (0x82C * 8 + 5)
#define                                 PSMC1BLKF5_bit      _BIT_ACCESS(PSMC1BLKF,5)
// PSMC1BLKF<PSMC1BLKF6>
extern volatile __bit                   PSMC1BLKF6          __at(0x4166);	// @ (0x82C * 8 + 6)
#define                                 PSMC1BLKF6_bit      _BIT_ACCESS(PSMC1BLKF,6)
// PSMC1BLKF<PSMC1BLKF7>
extern volatile __bit                   PSMC1BLKF7          __at(0x4167);	// @ (0x82C * 8 + 7)
#define                                 PSMC1BLKF7_bit      _BIT_ACCESS(PSMC1BLKF,7)
// PSMC1BLKR<PSMC1BLKR0>
extern volatile __bit                   PSMC1BLKR0          __at(0x4158);	// @ (0x82B * 8 + 0)
#define                                 PSMC1BLKR0_bit      _BIT_ACCESS(PSMC1BLKR,0)
// PSMC1BLKR<PSMC1BLKR1>
extern volatile __bit                   PSMC1BLKR1          __at(0x4159);	// @ (0x82B * 8 + 1)
#define                                 PSMC1BLKR1_bit      _BIT_ACCESS(PSMC1BLKR,1)
// PSMC1BLKR<PSMC1BLKR2>
extern volatile __bit                   PSMC1BLKR2          __at(0x415A);	// @ (0x82B * 8 + 2)
#define                                 PSMC1BLKR2_bit      _BIT_ACCESS(PSMC1BLKR,2)
// PSMC1BLKR<PSMC1BLKR3>
extern volatile __bit                   PSMC1BLKR3          __at(0x415B);	// @ (0x82B * 8 + 3)
#define                                 PSMC1BLKR3_bit      _BIT_ACCESS(PSMC1BLKR,3)
// PSMC1BLKR<PSMC1BLKR4>
extern volatile __bit                   PSMC1BLKR4          __at(0x415C);	// @ (0x82B * 8 + 4)
#define                                 PSMC1BLKR4_bit      _BIT_ACCESS(PSMC1BLKR,4)
// PSMC1BLKR<PSMC1BLKR5>
extern volatile __bit                   PSMC1BLKR5          __at(0x415D);	// @ (0x82B * 8 + 5)
#define                                 PSMC1BLKR5_bit      _BIT_ACCESS(PSMC1BLKR,5)
// PSMC1BLKR<PSMC1BLKR6>
extern volatile __bit                   PSMC1BLKR6          __at(0x415E);	// @ (0x82B * 8 + 6)
#define                                 PSMC1BLKR6_bit      _BIT_ACCESS(PSMC1BLKR,6)
// PSMC1BLKR<PSMC1BLKR7>
extern volatile __bit                   PSMC1BLKR7          __at(0x415F);	// @ (0x82B * 8 + 7)
#define                                 PSMC1BLKR7_bit      _BIT_ACCESS(PSMC1BLKR,7)
// PSMC1DBF<PSMC1DBF0>
extern volatile __bit                   PSMC1DBF0           __at(0x4150);	// @ (0x82A * 8 + 0)
#define                                 PSMC1DBF0_bit       _BIT_ACCESS(PSMC1DBF,0)
// PSMC1DBF<PSMC1DBF1>
extern volatile __bit                   PSMC1DBF1           __at(0x4151);	// @ (0x82A * 8 + 1)
#define                                 PSMC1DBF1_bit       _BIT_ACCESS(PSMC1DBF,1)
// PSMC1DBF<PSMC1DBF2>
extern volatile __bit                   PSMC1DBF2           __at(0x4152);	// @ (0x82A * 8 + 2)
#define                                 PSMC1DBF2_bit       _BIT_ACCESS(PSMC1DBF,2)
// PSMC1DBF<PSMC1DBF3>
extern volatile __bit                   PSMC1DBF3           __at(0x4153);	// @ (0x82A * 8 + 3)
#define                                 PSMC1DBF3_bit       _BIT_ACCESS(PSMC1DBF,3)
// PSMC1DBF<PSMC1DBF4>
extern volatile __bit                   PSMC1DBF4           __at(0x4154);	// @ (0x82A * 8 + 4)
#define                                 PSMC1DBF4_bit       _BIT_ACCESS(PSMC1DBF,4)
// PSMC1DBF<PSMC1DBF5>
extern volatile __bit                   PSMC1DBF5           __at(0x4155);	// @ (0x82A * 8 + 5)
#define                                 PSMC1DBF5_bit       _BIT_ACCESS(PSMC1DBF,5)
// PSMC1DBF<PSMC1DBF6>
extern volatile __bit                   PSMC1DBF6           __at(0x4156);	// @ (0x82A * 8 + 6)
#define                                 PSMC1DBF6_bit       _BIT_ACCESS(PSMC1DBF,6)
// PSMC1DBF<PSMC1DBF7>
extern volatile __bit                   PSMC1DBF7           __at(0x4157);	// @ (0x82A * 8 + 7)
#define                                 PSMC1DBF7_bit       _BIT_ACCESS(PSMC1DBF,7)
// PSMC1DBR<PSMC1DBR0>
extern volatile __bit                   PSMC1DBR0           __at(0x4148);	// @ (0x829 * 8 + 0)
#define                                 PSMC1DBR0_bit       _BIT_ACCESS(PSMC1DBR,0)
// PSMC1DBR<PSMC1DBR1>
extern volatile __bit                   PSMC1DBR1           __at(0x4149);	// @ (0x829 * 8 + 1)
#define                                 PSMC1DBR1_bit       _BIT_ACCESS(PSMC1DBR,1)
// PSMC1DBR<PSMC1DBR2>
extern volatile __bit                   PSMC1DBR2           __at(0x414A);	// @ (0x829 * 8 + 2)
#define                                 PSMC1DBR2_bit       _BIT_ACCESS(PSMC1DBR,2)
// PSMC1DBR<PSMC1DBR3>
extern volatile __bit                   PSMC1DBR3           __at(0x414B);	// @ (0x829 * 8 + 3)
#define                                 PSMC1DBR3_bit       _BIT_ACCESS(PSMC1DBR,3)
// PSMC1DBR<PSMC1DBR4>
extern volatile __bit                   PSMC1DBR4           __at(0x414C);	// @ (0x829 * 8 + 4)
#define                                 PSMC1DBR4_bit       _BIT_ACCESS(PSMC1DBR,4)
// PSMC1DBR<PSMC1DBR5>
extern volatile __bit                   PSMC1DBR5           __at(0x414D);	// @ (0x829 * 8 + 5)
#define                                 PSMC1DBR5_bit       _BIT_ACCESS(PSMC1DBR,5)
// PSMC1DBR<PSMC1DBR6>
extern volatile __bit                   PSMC1DBR6           __at(0x414E);	// @ (0x829 * 8 + 6)
#define                                 PSMC1DBR6_bit       _BIT_ACCESS(PSMC1DBR,6)
// PSMC1DBR<PSMC1DBR7>
extern volatile __bit                   PSMC1DBR7           __at(0x414F);	// @ (0x829 * 8 + 7)
#define                                 PSMC1DBR7_bit       _BIT_ACCESS(PSMC1DBR,7)
// PSMC1DCL<PSMC1DC0>
extern volatile __bit                   PSMC1DC0            __at(0x4118);	// @ (0x823 * 8 + 0)
#define                                 PSMC1DC0_bit        _BIT_ACCESS(PSMC1DCL,0)
// PSMC1DCL<PSMC1DC1>
extern volatile __bit                   PSMC1DC1            __at(0x4119);	// @ (0x823 * 8 + 1)
#define                                 PSMC1DC1_bit        _BIT_ACCESS(PSMC1DCL,1)
// PSMC1DCH<PSMC1DC10>
extern volatile __bit                   PSMC1DC10           __at(0x4122);	// @ (0x824 * 8 + 2)
#define                                 PSMC1DC10_bit       _BIT_ACCESS(PSMC1DCH,2)
// PSMC1DCH<PSMC1DC11>
extern volatile __bit                   PSMC1DC11           __at(0x4123);	// @ (0x824 * 8 + 3)
#define                                 PSMC1DC11_bit       _BIT_ACCESS(PSMC1DCH,3)
// PSMC1DCH<PSMC1DC12>
extern volatile __bit                   PSMC1DC12           __at(0x4124);	// @ (0x824 * 8 + 4)
#define                                 PSMC1DC12_bit       _BIT_ACCESS(PSMC1DCH,4)
// PSMC1DCH<PSMC1DC13>
extern volatile __bit                   PSMC1DC13           __at(0x4125);	// @ (0x824 * 8 + 5)
#define                                 PSMC1DC13_bit       _BIT_ACCESS(PSMC1DCH,5)
// PSMC1DCH<PSMC1DC14>
extern volatile __bit                   PSMC1DC14           __at(0x4126);	// @ (0x824 * 8 + 6)
#define                                 PSMC1DC14_bit       _BIT_ACCESS(PSMC1DCH,6)
// PSMC1DCH<PSMC1DC15>
extern volatile __bit                   PSMC1DC15           __at(0x4127);	// @ (0x824 * 8 + 7)
#define                                 PSMC1DC15_bit       _BIT_ACCESS(PSMC1DCH,7)
// PSMC1DCL<PSMC1DC2>
extern volatile __bit                   PSMC1DC2            __at(0x411A);	// @ (0x823 * 8 + 2)
#define                                 PSMC1DC2_bit        _BIT_ACCESS(PSMC1DCL,2)
// PSMC1DCL<PSMC1DC3>
extern volatile __bit                   PSMC1DC3            __at(0x411B);	// @ (0x823 * 8 + 3)
#define                                 PSMC1DC3_bit        _BIT_ACCESS(PSMC1DCL,3)
// PSMC1DCL<PSMC1DC4>
extern volatile __bit                   PSMC1DC4            __at(0x411C);	// @ (0x823 * 8 + 4)
#define                                 PSMC1DC4_bit        _BIT_ACCESS(PSMC1DCL,4)
// PSMC1DCL<PSMC1DC5>
extern volatile __bit                   PSMC1DC5            __at(0x411D);	// @ (0x823 * 8 + 5)
#define                                 PSMC1DC5_bit        _BIT_ACCESS(PSMC1DCL,5)
// PSMC1DCL<PSMC1DC6>
extern volatile __bit                   PSMC1DC6            __at(0x411E);	// @ (0x823 * 8 + 6)
#define                                 PSMC1DC6_bit        _BIT_ACCESS(PSMC1DCL,6)
// PSMC1DCL<PSMC1DC7>
extern volatile __bit                   PSMC1DC7            __at(0x411F);	// @ (0x823 * 8 + 7)
#define                                 PSMC1DC7_bit        _BIT_ACCESS(PSMC1DCL,7)
// PSMC1DCH<PSMC1DC8>
extern volatile __bit                   PSMC1DC8            __at(0x4120);	// @ (0x824 * 8 + 0)
#define                                 PSMC1DC8_bit        _BIT_ACCESS(PSMC1DCH,0)
// PSMC1DCH<PSMC1DC9>
extern volatile __bit                   PSMC1DC9            __at(0x4121);	// @ (0x824 * 8 + 1)
#define                                 PSMC1DC9_bit        _BIT_ACCESS(PSMC1DCH,1)
// PSMC1CON<PSMC1EN>
extern volatile __bit                   PSMC1EN             __at(0x408F);	// @ (0x811 * 8 + 7)
#define                                 PSMC1EN_bit         _BIT_ACCESS(PSMC1CON,7)
// PSMC1FFA<PSMC1FFA0>
extern volatile __bit                   PSMC1FFA0           __at(0x4168);	// @ (0x82D * 8 + 0)
#define                                 PSMC1FFA0_bit       _BIT_ACCESS(PSMC1FFA,0)
// PSMC1FFA<PSMC1FFA1>
extern volatile __bit                   PSMC1FFA1           __at(0x4169);	// @ (0x82D * 8 + 1)
#define                                 PSMC1FFA1_bit       _BIT_ACCESS(PSMC1FFA,1)
// PSMC1FFA<PSMC1FFA2>
extern volatile __bit                   PSMC1FFA2           __at(0x416A);	// @ (0x82D * 8 + 2)
#define                                 PSMC1FFA2_bit       _BIT_ACCESS(PSMC1FFA,2)
// PSMC1FFA<PSMC1FFA3>
extern volatile __bit                   PSMC1FFA3           __at(0x416B);	// @ (0x82D * 8 + 3)
#define                                 PSMC1FFA3_bit       _BIT_ACCESS(PSMC1FFA,3)
// PSMC1CON<PSMC1LD>
extern volatile __bit                   PSMC1LD             __at(0x408E);	// @ (0x811 * 8 + 6)
#define                                 PSMC1LD_bit         _BIT_ACCESS(PSMC1CON,6)
// PSMC1PHL<PSMC1PH0>
extern volatile __bit                   PSMC1PH0            __at(0x4108);	// @ (0x821 * 8 + 0)
#define                                 PSMC1PH0_bit        _BIT_ACCESS(PSMC1PHL,0)
// PSMC1PHL<PSMC1PH1>
extern volatile __bit                   PSMC1PH1            __at(0x4109);	// @ (0x821 * 8 + 1)
#define                                 PSMC1PH1_bit        _BIT_ACCESS(PSMC1PHL,1)
// PSMC1PHH<PSMC1PH10>
extern volatile __bit                   PSMC1PH10           __at(0x4112);	// @ (0x822 * 8 + 2)
#define                                 PSMC1PH10_bit       _BIT_ACCESS(PSMC1PHH,2)
// PSMC1PHH<PSMC1PH11>
extern volatile __bit                   PSMC1PH11           __at(0x4113);	// @ (0x822 * 8 + 3)
#define                                 PSMC1PH11_bit       _BIT_ACCESS(PSMC1PHH,3)
// PSMC1PHH<PSMC1PH12>
extern volatile __bit                   PSMC1PH12           __at(0x4114);	// @ (0x822 * 8 + 4)
#define                                 PSMC1PH12_bit       _BIT_ACCESS(PSMC1PHH,4)
// PSMC1PHH<PSMC1PH13>
extern volatile __bit                   PSMC1PH13           __at(0x4115);	// @ (0x822 * 8 + 5)
#define                                 PSMC1PH13_bit       _BIT_ACCESS(PSMC1PHH,5)
// PSMC1PHH<PSMC1PH14>
extern volatile __bit                   PSMC1PH14           __at(0x4116);	// @ (0x822 * 8 + 6)
#define                                 PSMC1PH14_bit       _BIT_ACCESS(PSMC1PHH,6)
// PSMC1PHH<PSMC1PH15>
extern volatile __bit                   PSMC1PH15           __at(0x4117);	// @ (0x822 * 8 + 7)
#define                                 PSMC1PH15_bit       _BIT_ACCESS(PSMC1PHH,7)
// PSMC1PHL<PSMC1PH2>
extern volatile __bit                   PSMC1PH2            __at(0x410A);	// @ (0x821 * 8 + 2)
#define                                 PSMC1PH2_bit        _BIT_ACCESS(PSMC1PHL,2)
// PSMC1PHL<PSMC1PH3>
extern volatile __bit                   PSMC1PH3            __at(0x410B);	// @ (0x821 * 8 + 3)
#define                                 PSMC1PH3_bit        _BIT_ACCESS(PSMC1PHL,3)
// PSMC1PHL<PSMC1PH4>
extern volatile __bit                   PSMC1PH4            __at(0x410C);	// @ (0x821 * 8 + 4)
#define                                 PSMC1PH4_bit        _BIT_ACCESS(PSMC1PHL,4)
// PSMC1PHL<PSMC1PH5>
extern volatile __bit                   PSMC1PH5            __at(0x410D);	// @ (0x821 * 8 + 5)
#define                                 PSMC1PH5_bit        _BIT_ACCESS(PSMC1PHL,5)
// PSMC1PHL<PSMC1PH6>
extern volatile __bit                   PSMC1PH6            __at(0x410E);	// @ (0x821 * 8 + 6)
#define                                 PSMC1PH6_bit        _BIT_ACCESS(PSMC1PHL,6)
// PSMC1PHL<PSMC1PH7>
extern volatile __bit                   PSMC1PH7            __at(0x410F);	// @ (0x821 * 8 + 7)
#define                                 PSMC1PH7_bit        _BIT_ACCESS(PSMC1PHL,7)
// PSMC1PHH<PSMC1PH8>
extern volatile __bit                   PSMC1PH8            __at(0x4110);	// @ (0x822 * 8 + 0)
#define                                 PSMC1PH8_bit        _BIT_ACCESS(PSMC1PHH,0)
// PSMC1PHH<PSMC1PH9>
extern volatile __bit                   PSMC1PH9            __at(0x4111);	// @ (0x822 * 8 + 1)
#define                                 PSMC1PH9_bit        _BIT_ACCESS(PSMC1PHH,1)
// PSMC1PRL<PSMC1PR0>
extern volatile __bit                   PSMC1PR0            __at(0x4128);	// @ (0x825 * 8 + 0)
#define                                 PSMC1PR0_bit        _BIT_ACCESS(PSMC1PRL,0)
// PSMC1PRL<PSMC1PR1>
extern volatile __bit                   PSMC1PR1            __at(0x4129);	// @ (0x825 * 8 + 1)
#define                                 PSMC1PR1_bit        _BIT_ACCESS(PSMC1PRL,1)
// PSMC1PRH<PSMC1PR10>
extern volatile __bit                   PSMC1PR10           __at(0x4132);	// @ (0x826 * 8 + 2)
#define                                 PSMC1PR10_bit       _BIT_ACCESS(PSMC1PRH,2)
// PSMC1PRH<PSMC1PR11>
extern volatile __bit                   PSMC1PR11           __at(0x4133);	// @ (0x826 * 8 + 3)
#define                                 PSMC1PR11_bit       _BIT_ACCESS(PSMC1PRH,3)
// PSMC1PRH<PSMC1PR12>
extern volatile __bit                   PSMC1PR12           __at(0x4134);	// @ (0x826 * 8 + 4)
#define                                 PSMC1PR12_bit       _BIT_ACCESS(PSMC1PRH,4)
// PSMC1PRH<PSMC1PR13>
extern volatile __bit                   PSMC1PR13           __at(0x4135);	// @ (0x826 * 8 + 5)
#define                                 PSMC1PR13_bit       _BIT_ACCESS(PSMC1PRH,5)
// PSMC1PRH<PSMC1PR14>
extern volatile __bit                   PSMC1PR14           __at(0x4136);	// @ (0x826 * 8 + 6)
